tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# tap "heroku/brew"
tap 'homebrew/bundle'

# brew 'docker-machine'
# brew 'packer'
# brew 'terraform'
# cask 'chef-server-ctl'
#brew 'imagemagick'
#brew 'postgresql', restart_service: true
#brew 'python'
#brew 'zsh'
#brew 'zsh-completions'
brew "git"
brew "openssl"
brew "rcm"
#brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]
brew "vim"
brew "watchman"
brew "zsh"
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'gcc' # this will take a while...
brew 'gdb'
brew 'git'
brew 'git-quick-stats'
brew 'git-secrets'
brew 'gmp' # Vim dependency
brew 'go'
brew 'gpg'
brew 'htop'
brew 'hub'
brew 'hub'
brew 'jq'
brew 'kubectl'
brew 'macvim'
brew 'make'
brew 'mysql'
brew 'openssl'
brew 'packer'
brew 'pyenv'
brew 'python3'
brew 'rbenv'
brew 'redis'
brew 'rsync'
brew 'ruby-install'
brew 'runit'
brew 'shellcheck'
brew 'terraform'
brew 'tmux'
brew 'vim'
brew 'wget'
brew "imagemagick"
brew 'mas' #https://github.com/mas-cli/mas

cask 'google-chrome'
# cask 'iterm2' #already intalled
cask 'authy'
cask 'virtualbox'
# cask 'minikube'
cask 'skype'
cask 'slack'
cask 'aviatrix-vpn-client'
cask 'github'
# cask 'sublime-text'
cask 'ngrok'
cask 'chef/chef/chefdk'
cask 'rectangle'
cask 'notion'
cask 'dropbox'
cask 'visual-studio-code'
