tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# tap "heroku/brew"
tap 'homebrew/bundle'

# brew 'packer'
# brew 'terraform'
# cask 'chef-server-ctl'
#brew "rcm"
#brew "reattach-to-user-namespace"
#brew "tmux"
#brew "watchman"
#brew 'awscli'
#brew 'imagemagick'
#brew 'mysql'
#brew 'postgresql', restart_service: true
#brew 'rbenv'
#brew 'redis'
#brew 'ruby-install'
brew "git"
brew "imagemagick"
brew "openssl"
brew "the_silver_searcher"
brew "vim"
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'gcc' # this will take a while...
brew 'git'
brew 'git-quick-stats'
brew 'git-secrets'
brew 'gmp' # Vim dependency
brew 'go'
brew 'gpg'
brew 'htop'
brew 'hub'
brew 'hub'
brew 'jq'
brew 'mas' #https://github.com/mas-cli/mas
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'rsync'
brew 'runit'
brew 'shellcheck'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
# brew 'openvpn-connect'
brew 'helm'

# cask 'iterm2' #already intalled
# cask 'minikube'
# cask 'sublime-text'
#cask 'aviatrix-vpn-client'
#cask 'chef/chef/chefdk'
#cask 'dropbox'
#cask 'rectangle'
#cask 'virtualbox'
cask 'authy'
cask 'github'
# cask 'google-chrome'
cask 'ngrok'
cask 'notion'
# cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'